Repository: gfazioli/WPKirk-Cron-Boilerplate
Catalog: languages/wp-kirk-*.po
Languages: it_it

source: WP Bones Boilerplate WordPress plugin
it_it: WP Bones Boilerplate Plugin WordPress

source: Overview
it_it: Panoramica

source: The cron schedule provider is a simple way to manage cron jobs in WordPress. It allows you to schedule a function to run at a specific time or interval.
it_it: Il provider di pianificazione cron è un modo semplice per gestire i cron job in WordPress. Consente di pianificare l'esecuzione di una funzione a un'ora o a un intervallo specifico.

source: Create a Schedule Service Provider
it_it: Creazione di un provider di servizi di pianificazione

source: You may create your own schedule service provider by following the steps below:
it_it: È possibile creare il proprio fornitore di servizi di pianificazione seguendo i passaggi seguenti:

source: In the `plugins/Provider` directory, the new provider will be created by default. Of course, you may create your schedule service provider manually and in any directory you prefer. You have to change the namespace accordingly.
it_it: Nella directory `plugins/Provider`, il nuovo provider verrà creato per impostazione predefinita. Naturalmente, puoi creare il tuo Service Provider di pianificazione manualmente e in qualsiasi directory tu preferisca. È necessario modificare lo spazio dei nomi di conseguenza.

source: The `run` method is the method that will be executed when the schedule event is triggered. You should define a unique hook name and recurrence for your schedule event. You may use the protected properties `$hook` and `$recurrence` to set the hook name and recurrence. Of course, you may override the `boot` method to set these properties. For example, you may set the recurrence from the database or from a configuration file.
it_it: Il metodo `run` è il metodo che verrà eseguito quando viene attivato l'evento di pianificazione. È necessario definire un nome di hook univoco e una ricorrenza per l'evento pianificato. È possibile utilizzare le proprietà protette `$hook` e `$recurrence` per impostare il nome dell'hook e la ricorrenza. Naturalmente, è possibile sovrascrivere il metodo 'boot' per impostare queste proprietà. Ad esempio, è possibile impostare la ricorrenza dal database o da un file di configurazione.

source: Load the Schedule Service Provider
it_it: Caricare il provider di servizi di pianificazione

source: Add this new Service Provider to the list of providers in the `/config/plugin.php` file:
it_it: Aggiungere questo nuovo Service Provider all'elenco dei fornitori nel file `/config/plugin.php`:

source: Clear the schedule event
it_it: Cancellare l'evento programmato

source: You don't need to clear the schedule event when you deactivate the plugin. WP Bones will do it for you. Anyway, you may use the `clear` method to do any cleanup when the plugin is deactivated.
it_it: Non è necessario cancellare l'evento di pianificazione quando si disattiva il plug-in. WP Bones lo farà per te. Ad ogni modo, è possibile utilizzare il metodo `clear` per eseguire qualsiasi pulizia quando il plugin è disattivato.
